Revit 2027 API
Camera.Transform Method
 Transforms the camera
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Transform(
	Transform trf
)
Public Sub Transform (
	trf As Transform
)
public:
void Transform(
	Transform^ trf
)
member Transform :
        trf : Transform -> unit
Parameters
trf Transform
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace